[
    {
        "url": "https://www.markhamknifesharpening.ca/",
        "content": "Markham Knife & Scissor Sharpening Near me Toronto Knife Sharpening top of page This site was designed with the .com website builder. Create your website today. Start Now Markham Knife & Scissor Sharpening 280 Yorktech Dr. Unit 15 Markham, ON 905-604-5352 Home Pricing Knife Rental Exchange / Subscription Shop Contact More Use tab to navigate through the menu items. We Are Open! ​ No Appointment Needed . Operating Hours Monday to Friday 11am to 430pm, Saturday 10am to 3 pm ​ Our store front is located near Costco & Home Depot off Woodbine Ave south of Hwy 7 in Markham. Lots of FREE parking. ​ All knives & scissors are sharpened on site by trained technicians by hand We use a combination of latest sharpening technology in addition to traditional whetstones to sharpen and preserve your blades We service Western and Asian double sided blades as well as Japanese single bevel blades. Salon & Grooming Shears, Clippers as well as other misc. tools are welcome Contractors - We Sharpen circular carbide tipped saw blades We DO NOT service Manicure / Pedicure tools (ie Nippers) Check out our Google reviews if you are unsure about our service Standard turn around time is 24 hours Same day service are best efforts and an additional rush fee may apply We also welcome Mail In Sharpening service if you are too far away ​ ​ For safety purposes, please bring your knives and scissors wrapped up in a dish towel or its sheath for transport. ​ We service all Knife Sharpening & Scissor Sharpening needs in Greater Toronto, Thornhill, Richmond Hill, Markham , Vaughan, Stouffville, Newmarket & surrounding areas. ​ ​ ​ Knife sharpening near me in Markham, Richmond Hill, Thornhill, Vaughan and Greater Toronto. Scissor shear sharpening in Markham, Toronto, Richmond Hill, Thornhill and Vaughan. Best knife sharpening in Markham. Where to sharpen my knives in Markham. Salon scissors shears sharpening service in Greater Toronto, Grooming scissor sharpening service in Markham. Barber Grooming clipper sharpening in Toronto, Clipper sharpening in Markham. Where to sharpen my grooming salon scissors in GTA. Toronto Knife Sharpening centre. Wicked Edge Sharpening in Canada to mirror finish for EDC, Benchmade, Spydeco knives. Axe Sharpening Toronto, Circular Carbide Saw Blades sharpening in Markham Toronto and Richmond Hill. Vaughan Maple Knife Scissor Tools sharpening. Mail in Knife Sharpening in Canada, Mail in Salon Scissor Sharpening Ontario. Commercial Knife Rental, kitchen knife rental exchange service, knife swap service in Toronto bottom of page",
        "hyperlinks": [
            "https://www.markhamknifesharpening.ca",
            "https://www.markhamknifesharpening.ca/pricing",
            "https://www.markhamknifesharpening.ca/knife-exchange-knife-rental",
            "https://www.markhamknifesharpening.ca/store-front",
            "https://www.markhamknifesharpening.ca/contact"
        ]
    },
    {
        "url": "https://www.markhamknifesharpening.ca/pricing",
        "content": "Toronto Knife Sharpening Pricing Western Style Knife Knife $1.25 per blade inch - ($6 minimum per knife blade) Meat chopper $1.50 per blade inch - ($10 minimum per knife blade) Asian Style Knife Double bevel Japanese Knife - $2 per blade inch ($ 10 minimum per knife blade) Single bevel Japanese Knife - $3 per blade inch ($20 minimum per knife blade) Chinese Cleaver (菜刀)- $10 and up Fixed & Folding (EDC) Blades Folding & Fixed Sporting Blade (EDC) - $10.00 and Up Wicked Edge Sharpening (mirror edge) - $15.00 per inch Knife Blade Repair Repair cost will be determined by the severity of the damage. Repair cost start at $5 per knife blade. Scissors, Shears & Clippers Household - $6.00 & Up Fabric- $10.00 & Up Pinking - $10.00 & Up Salon / Grooming - $20.00 & Up Grooming Curved - $25 & Up Barber Clippers- $12 & Up (additional cost may apply for cleaning and blade setting) Tools Carbide Tip Circular Saws - Click Here for Pricing * **We Do NOT service hand saws*** Chisels $7 and Up Garden Shears - $10.00 & Up Pruners - $7.00 & Up Rachet Pruners - $10 & Up Axe - $10.00 & Up Spades - $7.00 & Up Lawn Mower Blades ( Removed) - $15.00 & Up Electric Hedge Trimmer: (Please bring power cord or power source - we Do Not service Gas Trimmers) 14\"- $20, 16 \" - $25, 18 \"- $30, 20\" - $35, 24\" - $40 Machete- $15 & Up Please call us at 905-604-5352 for any items that are not listed. Knife sharpening near me in Markham, Richmond Hill, Thornhill, Vaughan and Toronto. Scissor sharpening in Markham, Toronto, Richmond Hill, Thornhill and Vaughan. Best knife sharpening in Markham. Where to sharpen my knives in Markham. Salon scissors sharpening service in Toronto, Grooming scissor sharpening service in Markham. Barber Grooming clipper sharpening in Toronto, Clipper sharpening in Markham. Where to sharpen my grooming salon scissors in GTA. Toronto Knife Sharpening centre. Wicked Edge Sharpening in Canada to mirror finish for EDC, Benchmade, Spydeco knives. Axe Sharpening Toronto, Circular Saw Blades sharpening in Markham Toronto and Richmond Hill. Vaughan Maple Knife Scissor Tools sharpening. Contractor Saw Blade Sharpening. Saw blades for hardwood flooring",
        "hyperlinks": [
            "https://www.markhamknifesharpening.ca",
            "https://www.markhamknifesharpening.ca/pricing",
            "https://www.markhamknifesharpening.ca/knife-exchange-knife-rental",
            "https://www.markhamknifesharpening.ca/store-front",
            "https://www.markhamknifesharpening.ca/contact",
            "https://www.markhamknifesharpening.ca/carbide-saw-blade-sharpening-prices"
        ]
    },
    {
        "url": "https://www.markhamknifesharpening.ca/knife-exchange-knife-rental",
        "content": "Commercial Kitchen Knife Rental Exchange Subscription service top of page This site was designed with the .com website builder. Create your website today. Start Now Markham Knife & Scissor Sharpening 280 Yorktech Dr. Unit 15 Markham, ON 905-604-5352 Home Pricing Knife Rental Exchange / Subscription Shop Contact More Use tab to navigate through the menu items. Commercial Kitchen Knife Rental & Exchange Service is NOW available. Sharp knives swapped out base on your scheduling needs. We have a variety of knives to tailor to your staff and cooking demands. ​ Contact us for more details : markhamknife@gmail.com 4 inch Pizza Wheel 4 inch Pairing Knife 8 inch Straight Boning Knife 8 inch Curve Boning Knife 9 inch Offset Serrated Sandwich Knife 8 inch Wide Chef Knife 10 inch Regular Chef Knife 10 inch Cimeter Steak Breaking Knife 12 inch Cimeter Steak Breaking Knife ( not in picture) 10 inch Straight Bread Knife 14 inch Ham / Meat Slicer bottom of page",
        "hyperlinks": [
            "https://www.markhamknifesharpening.ca",
            "https://www.markhamknifesharpening.ca/pricing",
            "https://www.markhamknifesharpening.ca/knife-exchange-knife-rental",
            "https://www.markhamknifesharpening.ca/store-front",
            "https://www.markhamknifesharpening.ca/contact"
        ]
    },
    {
        "url": "https://www.markhamknifesharpening.ca/store-front",
        "content": "Shop | Live MKS site MKS Store is Now Open Click to Enter",
        "hyperlinks": [
            "https://www.markhamknifesharpening.ca",
            "https://www.markhamknifesharpening.ca/pricing",
            "https://www.markhamknifesharpening.ca/knife-exchange-knife-rental",
            "https://www.markhamknifesharpening.ca/store-front",
            "https://www.markhamknifesharpening.ca/contact"
        ]
    },
    {
        "url": "https://www.markhamknifesharpening.ca/contact",
        "content": "Toronto Knife Scissor Sharpening top of page This site was designed with the .com website builder. Create your website today. Start Now Markham Knife & Scissor Sharpening 280 Yorktech Dr. Unit 15 Markham, ON 905-604-5352 Home Pricing Knife Rental Exchange / Subscription Shop Contact More Use tab to navigate through the menu items. STORE FRONT ADDRESS ​ 280 Yorktech Dr. Unit 15 Markham, ON L6G0A6 ​ **Free Parking** ​ TEL - 905-604-5352 Email - markhamknife@gmail.com ​ Business Hours: Mon to Fri: 11am to 4:30pm Sat: 10am to 2pm​​ ​Sunday: Closed ​ Contact Us Submit Thank You. We will respond shortly. bottom of page",
        "hyperlinks": [
            "https://www.markhamknifesharpening.ca",
            "https://www.markhamknifesharpening.ca/pricing",
            "https://www.markhamknifesharpening.ca/knife-exchange-knife-rental",
            "https://www.markhamknifesharpening.ca/store-front",
            "https://www.markhamknifesharpening.ca/contact"
        ]
    },
    {
        "url": "https://www.markhamknifesharpening.ca/carbide-saw-blade-sharpening-prices",
        "content": "Carbide Saw Blade Sharpening Prices | Live MKS site top of page This site was designed with the .com website builder. Create your website today. Start Now Markham Knife & Scissor Sharpening 280 Yorktech Dr. Unit 15 Markham, ON 905-604-5352 Home Pricing Knife Rental Exchange / Subscription Shop Contact More Use tab to navigate through the menu items. Carbide Saw Blade Sharpening Prices: 10\" & 12\" Diameter Saw Blades ​ 20T - $15 30T - $15 40T - $15 50T - $17 60T - $18 70T - $18 80T - $20 90T - $22 100T - $22 ​ Please contact us for bulk pricing. We can also arrange pick up and delivery. bottom of page",
        "hyperlinks": [
            "https://www.markhamknifesharpening.ca",
            "https://www.markhamknifesharpening.ca/pricing",
            "https://www.markhamknifesharpening.ca/knife-exchange-knife-rental",
            "https://www.markhamknifesharpening.ca/store-front",
            "https://www.markhamknifesharpening.ca/contact"
        ]
    }
]